###Chapter 6 task 1


"""
Усунення лексичної багатозначності слів є складною областю в обробці природної мови.
Є цілий ряд різних підходів до даної проблеми, але на даний час найбільш точним є залучення керівних методів для тренування тегів з використанням анотованого корпусу.
Велика кількість анотованих даних необхідна для розробки такого програмного забезпечення у зв'язку з складністю проблеми та різних контекстів, в яких може траплятися дане слово.
#Що стосується тегування частини мови, то чим більше даних бачить тег у тренуванні, тим кращою буде його точність при обробці нових даних.
"""
