Python 3.4.3 (v3.4.3:9b73f1c3e601, Feb 24 2015, 22:43:06) [MSC v.1600 32 bit (Intel)] on win32
Type "copyright", "credits" or "license()" for more information.
>>> # Відкрити файли з позитивними і негативними словами
>>> f1=open('E:/КУРСОВА КЛ/positive1.txt', encoding='utf-8')
>>> f2=open('E:/КУРСОВА КЛ/negative1.txt', encoding='utf-8')
>>> pos_w=[]
>>> # Збереження позитивних слів у список
>>> for i in f1.readlines():
	pos_w.append(i[:-1])

	
>>> # Вивід на екран кількість позитивних слів
>>> print ('pos', len(pos_w))
pos 142
>>> neg_w=[]
>>> # Збереження негативних слів у список
>>> for i in f2.readlines():
	neg_w.append(i[:-1])

	
>>> # Вивід на екран кількість негативних слів
>>> print ('neg', len(neg_w))
neg 58
>>> rez=[]
>>> # Відкрити файли зі згенерованим словником
>>> f3=open('E:/КУРСОВА КЛ/rez_domen5.txt', encoding='utf-8')
>>> # Збереження у список слів та їх тональності зі словника, якщо це слово
# є у списку позитивних слів
>>> for i in f3.readlines():
	#print (i.split(',')[0])
	if i.split(',')[0] in pos_w:
		#print (i.split(',')[0])
		rez.append(i.split(',')[:2])

		
>>> # Вивід на екран кількості слів зі словника, які є серед позитивних слів
>>> print ('rez', len(rez))
rez 35
>>> # Вивід на екран відношення кількості слів зі словника
# до кількості позитивних слів
>>> print ('Recall_pos', len(rez)/len(pos_w))
Recall_pos 0.24647887323943662
>>> # Відкриття і запис у файл слів зі словника, які є серед позитивних слів
>>> z=open('E:\КУРСОВА КЛ\pos_domen_rez5.txt','w')
>>> for i in rez:
	z.write(str(i)+'\n')

	
21
20
17
20
17
22
17
16
14
18
18
19
18
18
17
16
16
17
15
14
15
21
14
20
16
16
20
17
15
19
17
18
18
17
17
>>> z.close()
>>> rez=[]
>>> # Відкрити файли зі згенерованим словником
>>> f3=open('E:/КУРСОВА КЛ/rez_domen5.txt', encoding='utf-8')
>>> # Збереження у список слів та їх тональності зі словника, якщо це слово
# є у списку негативних слів
>>> for i in f3.readlines():
	#print (i.split(',')[0])
	if i.split(',')[0] in neg_w:
		#print (i.split(',')[0])
		rez.append(i.split(',')[:2])

		
>>> # Вивід на екран кількості слів зі словника, які є серед негативних слів
>>> print ('rez', len(rez))
rez 18
>>> # Вивід на екран відношення кількості слів зі словника
# до кількості негативних слів
>>> print ('Recall_neg', len(rez)/len(neg_w))
Recall_neg 0.3103448275862069
>>> # Відкриття і запис у файл слів зі словника, які є серед негативних слів
>>> z=open('E:/КУРСОВА КЛ/neg_domen_rez5.txt','w')
>>> for i in rez:
	z.write(str(i)+'\n')

	
16
14
19
21
16
19
13
16
16
14
15
12
18
23
15
18
18
18
>>> z.close()
>>> 
