
Огляньте корпус PP Attachment і спробуйте запропонувати деякі фактори, які впливають на додатки PP.
На мою думку, на прийменникові вирази впливає неоднозначність.
Наприклад, є два речення: 
a.  The guy saw a girl with  a dog. (побачив дівчину з собачкою)
b.  The guy saw a girl with a telescope . (побачив дівчину за допомогою телескопа)

У двох реченнях є прийменниковий вираз, який починається зі слова with.
У першому випадку, слово with, змінює іменник girl (дівчина),а у другому дієслово saw (бачив).
Через такі неоднозначності, структура дерева змінюється докорінно.
